EDT/УТ/src/Reports/Приложение_4_ММ/Приложение_4_ММ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>Приложение_4_ММ</name>
</mdclass:Report>

EDT/УТ/src/AccumulationRegisters/ЗакрытыеЗаказы/ЗакрытыеЗаказы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЗакрытыеЗаказы</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>СуммаОценочная</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаПолученная</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаДоставкиДоМКАД</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаДоставкиЗаМКАД</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>УслугиСД</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>БанковскаяКомиссия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КассовоеОбслуживание</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаВозврата</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Масса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаЧастичногоВозврата</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОплаченоКлиентовНал</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>АгентскоеВознаграждение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПредоплатаПоКредиту</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>УслугиСДЧистые</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтраховойСбор</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ФактическийВес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОбъемЗабора</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОбъемЗабораПоЗаказам</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВыгруженныйОбъем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТарифицируемыйВес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтоимостьОценочнаяПоТоварно</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоПереносовСЗаездами</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтоимостьПереносовСЗаездами</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтоимостьПодъемаМП</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоТарифицируемыхРейсов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВознаграждениеАгентаПоПредоплаченнымЗаказам</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ФрахтЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТарифицируемыйОбъемныйВес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Поступление</name>
    <type>
      <types>DocumentRef.ПоступлениеТоваровУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>Списание</name>
    <type>
      <types>DocumentRef.СписаниеТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>Оприходование</name>
    <type>
      <types>DocumentRef.ОприходованиеТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>Перемещение</name>
    <type>
      <types>DocumentRef.ПеремещениеТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>Доставка</name>
    <type>
      <types>BusinessProcessRef.новаМестнаяДоставка</types>
    </type>
  </attributes>
  <attributes>
    <name>Возврат</name>
    <type>
      <types>DocumentRef.ВозвратТоваровОтПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>ПризнакВозврата</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОценочнаяСтоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Корректировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТарификацияПоОбъемномуВесу</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>ЮрЛицо</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипЗаказа</name>
    <type>
      <types>EnumRef.ТипыЗаказов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Транспорт</name>
    <type>
      <types>CatalogRef.новаТранспорт</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИнтернетМагазин</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КатегорияДоставки</name>
    <type>
      <types>CatalogRef.КатегорииДоставки2014</types>
      <types>CatalogRef.КатегорииДоставки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Водитель</name>
    <type>
      <types>CatalogRef.новаВодители</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Экспедитор</name>
    <type>
      <types>CatalogRef.новаЭкспедиторы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Реализация</name>
    <type>
      <types>DocumentRef.ЗаборТовара</types>
      <types>DocumentRef.Фрахт</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипОплаты</name>
    <type>
      <types>CatalogRef.ТипыОплат</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатусЗаказа</name>
    <type>
      <types>CatalogRef.новаРезультатМестнойДоставки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПричинаНевыполнения</name>
    <type>
      <types>CatalogRef.ПричиныНеВыполненияДоставки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатусИнтернетМагазина</name>
    <type>
      <types>CatalogRef.СтатусЗаказаИнтернетМагазина</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПричинаОтказа</name>
    <type>
      <types>CatalogRef.ПричиныОтказаПереноса</types>
    </type>
  </dimensions>
  <dimensions>
    <name>VIPДоставка</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидVip</name>
    <type>
      <types>CatalogRef.ВидыVip</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТарифнаяСетка</name>
    <type>
      <types>CatalogRef.ТипыТарифов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РасчетныйБрейк</name>
    <type>
      <types>CatalogRef.РасчетныеБрейки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТарифнаяСеткаПартнера</name>
    <type>
      <types>CatalogRef.ТарифныеСетки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗонаТарификации</name>
    <type>
      <types>CatalogRef.ГруппыРайонов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПричинаОтклоненияЗаказа</name>
    <comment>Причина отклонения заказа в системе</comment>
    <type>
      <types>CatalogRef.ПричиныОтклоненияЗаказаВСистеме</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТерминалДоставки</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТерминалПриёма</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъемныйБрейк</name>
    <type>
      <types>CatalogRef.ОбъемныеБрейки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПодъемныйБрейк</name>
    <type>
      <types>CatalogRef.ВесовыеБрейкиРасчетаСтоимостиПодъемов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

EDT/УТ/src/Catalogs/ТипыОплат/ТипыОплат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТипыОплат</name>
  <predefined>
    <items>
      <name>БезРасчетов</name>
      <description>Без расчетов</description>
    </items>
    <items>
      <name>БезналичныйРасчет</name>
      <description>Безналичный расчет</description>
    </items>
    <items>
      <name>ВКредит</name>
      <description>В кредит</description>
    </items>
    <items>
      <name>Наличные</name>
      <description>Наличные</description>
    </items>
    <items>
      <name>ОплатаDPD</name>
      <description>Оплата DPD</description>
    </items>
    <items>
      <name>ОплатаКартой</name>
      <description>Оплата картой</description>
    </items>
    <items>
      <name>ОплаченоВМагазине</name>
      <description>Оплачено в магазине</description>
    </items>
    <items>
      <name>СБП</name>
      <description>СБП</description>
    </items>
    <items>
      <name>Терминал</name>
      <description>Терминал</description>
    </items>
    <items>
      <name>ЯндексДеньги</name>
      <description>Яндекс Деньги</description>
    </items>
  </predefined>
  <attributes>
    <name>КодОплаты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СекцияТоваров</name>
    <type>
      <types>CatalogRef.СекцияККМ</types>
    </type>
  </attributes>
  <attributes>
    <name>СекцияУслуг</name>
    <type>
      <types>CatalogRef.СекцияККМ</types>
    </type>
  </attributes>
  <attributes>
    <name>БезналичнаяОплата</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СекцияТоваровНДС</name>
    <type>
      <types>CatalogRef.СекцияККМ</types>
    </type>
  </attributes>
  <attributes>
    <name>КодОплатыНаККМ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

EDT/УТ/src/Reports/Приложение_4_ММ/ObjectModule.bsl
Функция Печать(Таб, НачПериода, КонПериода, Контрагент, СИтогамиПоДням, флПоказыватьОшибки, ДокОтчет = Неопределено, Сравнение = Ложь, ТолькоИзНакладной003 = Ложь, Гибрид = Ложь, СтрокаНомеров = Неопределено, ТерминалДоставки = Неопределено) Экспорт
	Таб.Очистить();
	
	ЗапАдминка = Новый Запрос;
	ЗапАдминка.Текст = "ВЫБРАТЬ
	                   |	ВЫБОР
	                   |		КОГДА dbo_mv_orders.status <> 4
	                   |			ТОГДА dbo_mv_orders.orderSumRUR_all
	                   |		ИНАЧЕ 0
	                   |	КОНЕЦ КАК ПолнаяСуммаЗаказа,
	                   |	ВЫБОР
	                   |		КОГДА dbo_mv_orders.status <> 4
	                   |			ТОГДА dbo_mv_orders.serviceDC
	                   |		ИНАЧЕ 0
	                   |	КОНЕЦ КАК УслугиСД,
	                   |	ВЫБОР
	                   |		КОГДА dbo_mv_orders.status <> 4
	                   |			ТОГДА dbo_mv_orders.cashService
	                   |		ИНАЧЕ 0
	                   |	КОНЕЦ КАК КассовоеОбслуживание,
	                   |	dbo_mv_orders.orderIDStr КАК ВнешнийНомер
	                   |ИЗ
	                   |	ВнешнийИсточникДанных.ИнтернетМагазин.Таблица.dbo_mv_orders КАК dbo_mv_orders
	                   |ГДЕ
	                   |	dbo_mv_orders.completeDate МЕЖДУ &НачДата И &КонДата
	                   |	И dbo_mv_orders.internetShopID = &internetShopID";
	ЗапАдминка.УстановитьПараметр("internetShopID", 181);
	ЗапАдминка.УстановитьПараметр("НачДата", НачалоДня(НачПериода));
	ЗапАдминка.УстановитьПараметр("КонДата", КонецДня(КонПериода));
	
	
	
	РезАдминка = ЗапАдминка.Выполнить().Выгрузить();
	резАдминка.Колонки.Добавить("ВнешнийНомер2");
	Для Каждого Тек Из РезАдминка Цикл
		Тек.ВнешнийНомер2 = СокрЛП(Тек.ВнешнийНомер);
	КонецЦикла;	
	
	
	Зап003 = Новый Запрос;
	Зап003.Текст = "ВЫБРАТЬ
	               |	Накладная003Заказы.Заказ.Номер КАК НомерВнешнегоЗаказа
	               |ИЗ
	               |	Документ.Накладная003.Заказы КАК Накладная003Заказы
	               |ГДЕ
	               |	Накладная003Заказы.Ссылка.ПометкаУдаления = ЛОЖЬ
	               |	И Накладная003Заказы.Ссылка.Дата МЕЖДУ &ДатаНач И &ДатаКон
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Накладная003Заказы.Заказ.Номер";
				   
	Зап003.УстановитьПараметр("ДатаНач", НачалоДня(НачПериода) - 31*86400);			   
	Зап003.УстановитьПараметр("ДатаКон", КонецДня(КонПериода) - 86400);			   
	
	Рез003 = Зап003.Выполнить().Выгрузить();
	
	
	

	
	МаксДПМП = Дата("00010101");
	Если Гибрид Тогда
		ЗапГ = Новый Запрос;
		ЗапГ.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		             |	ОтчетПоМнениюПартнера.Период КАК Период
		             |ИЗ
		             |	РегистрНакопления.ОтчетПоМнениюПартнера КАК ОтчетПоМнениюПартнера
		             |ГДЕ
		             |	ОтчетПоМнениюПартнера.Период МЕЖДУ &НачПериода И &КонПериода
		             |
		             |УПОРЯДОЧИТЬ ПО
		             |	Период УБЫВ";
		ЗапГ.УстановитьПараметр("НачПериода", НачалоДня(НачПериода));			 
		ЗапГ.УстановитьПараметр("КонПериода", КонецДня(КонПериода));			 
		РезГ = ЗапГ.Выполнить().Выбрать();
		Если РезГ.Следующий() Тогда
			МаксДПМП = РезГ.Период;
		КонецеСли;	
	КонецЕсли;	
	
	
	Зап = Новый Запрос;
	Если не ЗначениеЗаполнено(МаксДПМП) Тогда
		Зап.Текст = "ВЫБРАТЬ
		            |	ЗакрытиеЗаказовТовары.Реализация,
		            |	СУММА(ЗакрытиеЗаказовТовары.Количество) КАК Количество
		            |ПОМЕСТИТЬ ВТКоличества
		            |ИЗ
		            |	Документ.ЗакрытиеЗаказов.Товары КАК ЗакрытиеЗаказовТовары
		            |ГДЕ
		            |	ЗакрытиеЗаказовТовары.Реализация.Дата МЕЖДУ &НачПериода И &КонПериода
		            |	И ЗакрытиеЗаказовТовары.Ссылка.Проведен = ИСТИНА
		            |
		            |СГРУППИРОВАТЬ ПО
		            |	ЗакрытиеЗаказовТовары.Реализация
		            |;
		            |
		            |////////////////////////////////////////////////////////////////////////////////
		            |ВЫБРАТЬ
		            |	ЗакрытыеЗаказы.ЮрЛицо,
		            |	ЗакрытыеЗаказы.ТипЗаказа,
		            |	ЗакрытыеЗаказы.Транспорт,
		            |	ЗакрытыеЗаказы.ИнтернетМагазин,
		            |	ЗакрытыеЗаказы.КатегорияДоставки,
		            |	ЗакрытыеЗаказы.Водитель,
		            |	ЗакрытыеЗаказы.Экспедитор,
		            |	ЗакрытыеЗаказы.Клиент,
		            |	ЗакрытыеЗаказы.Реализация,
		            |	ЗакрытыеЗаказы.ТипОплаты,
		            |	ЗакрытыеЗаказы.СтатусЗаказа,
		            |	ЗакрытыеЗаказы.ПричинаНевыполнения,
		            |	ЗакрытыеЗаказы.СтатусИнтернетМагазина,
		            |	ЗакрытыеЗаказы.ПричинаОтказа,
		            |	ЗакрытыеЗаказы.VIPДоставка,
		            |	ЗакрытыеЗаказы.ВидVip,
		            |	ЗакрытыеЗаказы.ТарифнаяСетка,
		            |	ЗакрытыеЗаказы.РасчетныйБрейк,
		            |	ЗакрытыеЗаказы.ТарифнаяСеткаПартнера,
		            |	ЗакрытыеЗаказы.ЗонаТарификации,
		            |	ЗакрытыеЗаказы.ПричинаОтклоненияЗаказа,
		            |	ЗакрытыеЗаказы.Партнер,
		            |	ЗакрытыеЗаказы.ТерминалДоставки,
		            |	ЗакрытыеЗаказы.ТерминалПриёма,
		            |	ЗакрытыеЗаказы.ОбъемныйБрейк,
		            |	СУММА(ЗакрытыеЗаказы.СуммаОценочная) КАК СуммаОценочная,
		            |	СУММА(ЗакрытыеЗаказы.СуммаПолученная) КАК СуммаПолученная,
		            |	СУММА(ЗакрытыеЗаказы.СуммаДоставкиДоМКАД) КАК СуммаДоставкиДоМКАД,
		            |	СУММА(ЗакрытыеЗаказы.СуммаДоставкиЗаМКАД) КАК СуммаДоставкиЗаМКАД,
		            |	СУММА(ЗакрытыеЗаказы.УслугиСД) КАК УслугиСД,
		            |	СУММА(ЗакрытыеЗаказы.БанковскаяКомиссия) КАК БанковскаяКомиссия,
		            |	СУММА(ЗакрытыеЗаказы.КассовоеОбслуживание) КАК КассовоеОбслуживание,
		            |	СУММА(ЗакрытыеЗаказы.СуммаВозврата) КАК СуммаВозврата,
		            |	СУММА(ЗакрытыеЗаказы.Масса) КАК Масса,
		            |	СУММА(ЗакрытыеЗаказы.СуммаЧастичногоВозврата) КАК СуммаЧастичногоВозврата,
		            |	СУММА(ЗакрытыеЗаказы.ОплаченоКлиентовНал) КАК ОплаченоКлиентовНал,
		            |	СУММА(ЗакрытыеЗаказы.АгентскоеВознаграждение) КАК АгентскоеВознаграждение,
		            |	СУММА(ЗакрытыеЗаказы.ПредоплатаПоКредиту) КАК ПредоплатаПоКредиту,
		            |	СУММА(ЗакрытыеЗаказы.УслугиСДЧистые) КАК УслугиСДЧистые,
		            |	СУММА(ЗакрытыеЗаказы.СтраховойСбор) КАК СтраховойСбор,
		            |	СУММА(ЗакрытыеЗаказы.ФактическийВес) КАК ФактическийВес,
		            |	СУММА(ЗакрытыеЗаказы.ОбъемЗабора) КАК ОбъемЗабора,
		            |	СУММА(ЗакрытыеЗаказы.ОбъемЗабораПоЗаказам) КАК ОбъемЗабораПоЗаказам,
		            |	СУММА(ЗакрытыеЗаказы.ВыгруженныйОбъем) КАК ВыгруженныйОбъем,
		            |	ЗакрытыеЗаказы.Поступление,
		            |	ЗакрытыеЗаказы.Списание,
		            |	ЗакрытыеЗаказы.Оприходование,
		            |	ЗакрытыеЗаказы.Перемещение,
		            |	ЗакрытыеЗаказы.Доставка,
		            |	ЗакрытыеЗаказы.Возврат,
		            |	ЗакрытыеЗаказы.ПризнакВозврата,
		            |	ЗакрытыеЗаказы.ОценочнаяСтоимость КАК ОценочнаяСтоимость
		            |ПОМЕСТИТЬ ВТ_ЗакрытыеЗаказыОборот
		            |ИЗ
		            |	РегистрНакопления.ЗакрытыеЗаказы КАК ЗакрытыеЗаказы
		            |ГДЕ
		            |	ЗакрытыеЗаказы.Период МЕЖДУ &НачПериода И &КонПериода
		            |	И ЗакрытыеЗаказы.ИнтернетМагазин = &Контрагент
		            |	И ЗакрытыеЗаказы.ТипЗаказа.Ссылка В (ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Доставка), ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Забор), ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Фрахт), ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Забор), ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Самовывоз))
		            |
		            |СГРУППИРОВАТЬ ПО
		            |	ЗакрытыеЗаказы.Экспедитор,
		            |	ЗакрытыеЗаказы.Реализация,
		            |	ЗакрытыеЗаказы.ПризнакВозврата,
		            |	ЗакрытыеЗаказы.Возврат,
		            |	ЗакрытыеЗаказы.Доставка,
		            |	ЗакрытыеЗаказы.Перемещение,
		            |	ЗакрытыеЗаказы.Оприходование,
		            |	ЗакрытыеЗаказы.Списание,
		            |	ЗакрытыеЗаказы.Поступление,
		            |	ЗакрытыеЗаказы.Клиент,
		            |	ЗакрытыеЗаказы.ТипОплаты,
		            |	ЗакрытыеЗаказы.СтатусЗаказа,
		            |	ЗакрытыеЗаказы.ПричинаНевыполнения,
		            |	ЗакрытыеЗаказы.СтатусИнтернетМагазина,
		            |	ЗакрытыеЗаказы.ПричинаОтказа,
		            |	ЗакрытыеЗаказы.ВидVip,
		            |	ЗакрытыеЗаказы.VIPДоставка,
		            |	ЗакрытыеЗаказы.ТарифнаяСетка,
		            |	ЗакрытыеЗаказы.ЮрЛицо,
		            |	ЗакрытыеЗаказы.ТипЗаказа,
		            |	ЗакрытыеЗаказы.Транспорт,
		            |	ЗакрытыеЗаказы.Водитель,
		            |	ЗакрытыеЗаказы.ТарифнаяСеткаПартнера,
		            |	ЗакрытыеЗаказы.ЗонаТарификации,
		            |	ЗакрытыеЗаказы.РасчетныйБрейк,
		            |	ЗакрытыеЗаказы.ПричинаОтклоненияЗаказа,
		            |	ЗакрытыеЗаказы.Партнер,
		            |	ЗакрытыеЗаказы.ТерминалДоставки,
		            |	ЗакрытыеЗаказы.ТерминалПриёма,
		            |	ЗакрытыеЗаказы.ОбъемныйБрейк,
		            |	ЗакрытыеЗаказы.ИнтернетМагазин,
		            |	ЗакрытыеЗаказы.КатегорияДоставки,
		            |	ЗакрытыеЗаказы.ОценочнаяСтоимость
		            |;
		            |
		            |////////////////////////////////////////////////////////////////////////////////
		            |ВЫБРАТЬ
		            |	МИНИМУМ(ПлатежноеПоручениеИсходящееТаблицаДатОплат.Ссылка.Дата) КАК Дата,
		            |	ГОД(ПлатежноеПоручениеИсходящееТаблицаДатОплат.ДатаДоставки) КАК ГодДоставки,
		            |	МЕСЯЦ(ПлатежноеПоручениеИсходящееТаблицаДатОплат.ДатаДоставки) КАК МесяцДоставки,
		            |	ДЕНЬ(ПлатежноеПоручениеИсходящееТаблицаДатОплат.ДатаДоставки) КАК ДеньДоставки
		            |ПОМЕСТИТЬ ВТОплаты
		            |ИЗ
		            |	Документ.ПлатежноеПоручениеИсходящее.ТаблицаДатОплат КАК ПлатежноеПоручениеИсходящееТаблицаДатОплат
		            |ГДЕ
		            |	ПлатежноеПоручениеИсходящееТаблицаДатОплат.Ссылка.Проведен = ИСТИНА
		            |	И ПлатежноеПоручениеИсходящееТаблицаДатОплат.Ссылка.Контрагент = &Контрагент
		            |	И ПлатежноеПоручениеИсходящееТаблицаДатОплат.ДатаДоставки МЕЖДУ &НачПериода И &КонПериода
		            |
		            |СГРУППИРОВАТЬ ПО
		            |	ГОД(ПлатежноеПоручениеИсходящееТаблицаДатОплат.ДатаДоставки),
		            |	МЕСЯЦ(ПлатежноеПоручениеИсходящееТаблицаДатОплат.ДатаДоставки),
		            |	ДЕНЬ(ПлатежноеПоручениеИсходящееТаблицаДатОплат.ДатаДоставки)
		            |;
		            |
		            |////////////////////////////////////////////////////////////////////////////////
		            |ВЫБРАТЬ
		            |	ЗакрытыеЗаказы.ИнтернетМагазин,
		            |	ЗакрытыеЗаказы.Реализация,
		            |	ЗакрытыеЗаказы.Реализация.Номер КАК НомерЗаказа,
		            |	ЗакрытыеЗаказы.Реализация.НомерВнешнегоЗаказа КАК НомерВнешнегоЗаказа,
		            |	ЗакрытыеЗаказы.Реализация.Дата КАК ДатаДоставки,
		            |	ВЫБОР
		            |		КОГДА ЗакрытыеЗаказы.ТипЗаказа <> ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.самовывоз)
		            |			ТОГДА ВЫБОР
		            |					КОГДА ЗакрытыеЗаказы.ПричинаНевыполнения.Ссылка В (ЗНАЧЕНИЕ(Справочник.ПричиныНевыполненияДоставки.ОтказКлиентаСЗаездом), ЗНАЧЕНИЕ(Справочник.ПричиныНевыполненияДоставки.ОтказКлиентаБезЗаезда))
		            |							ИЛИ ЗакрытыеЗаказы.СтатусИнтернетМагазина = ЗНАЧЕНИЕ(Справочник.СтатусЗаказаИнтернетМагазина.ЗаказОтклонен)
		            |								И ЗакрытыеЗаказы.ПричинаНевыполнения = ЗНАЧЕНИЕ(Справочник.ПричиныНевыполненияДоставки.ПустаяСсылка)
		            |						ТОГДА ""ОТКАЗ""
		            |					ИНАЧЕ ВЫБОР
		            |							КОГДА ЗакрытыеЗаказы.ТипЗаказа = ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Забор)
		            |								ТОГДА ""ЗАБОР""
		            |							ИНАЧЕ ВЫБОР
		            |									КОГДА ЗакрытыеЗаказы.ТипЗаказа = ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Доставка)
		            |											ИЛИ ЗакрытыеЗаказы.ТипЗаказа = ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Фрахт)
		            |										ТОГДА ВЫБОР
		            |												КОГДА ЗакрытыеЗаказы.СуммаОценочная = 0
		            |														И ВТКоличества.Количество = 0
		            |													ТОГДА ""ОБМЕН""
		            |												ИНАЧЕ ВЫБОР
		            |														КОГДА ЗакрытыеЗаказы.СуммаОценочная < 0
		            |															ТОГДА ""ВОЗВРАТ""
		            |														ИНАЧЕ ""ДОСТАВКА""
		            |													КОНЕЦ
		            |											КОНЕЦ
		            |									ИНАЧЕ """"
		            |								КОНЕЦ
		            |						КОНЕЦ
		            |				КОНЕЦ
		            |		ИНАЧЕ ""САМОВЫВОЗ""
		            |	КОНЕЦ КАК ВидРабот,
		            |	ЗакрытыеЗаказы.Доставка.ДатаСоздания КАК ДатаЗабора,
		            |	ВЫБОР
		            |		КОГДА ЗакрытыеЗаказы.СуммаОценочная >= 0
		            |			ТОГДА ЗакрытыеЗаказы.СуммаОценочная + ЗакрытыеЗаказы.СуммаДоставкиДоМКАД + ЗакрытыеЗаказы.СуммаДоставкиЗаМКАД
		            |		ИНАЧЕ -ЗакрытыеЗаказы.СуммаОценочная + ЗакрытыеЗаказы.СуммаДоставкиДоМКАД + ЗакрытыеЗаказы.СуммаДоставкиЗаМКАД
		            |	КОНЕЦ КАК СтоимостьГруза,
		            |	ВЫБОР
		            |		КОГДА ЗакрытыеЗаказы.СуммаЧастичногоВозврата = ЗакрытыеЗаказы.СуммаОценочная
		            |			ТОГДА ВЫБОР
		            |					КОГДА ЗакрытыеЗаказы.СуммаОценочная < 0
		            |						ТОГДА -ЗакрытыеЗаказы.СуммаЧастичногоВозврата - ЗакрытыеЗаказы.СуммаДоставкиДоМКАД - ЗакрытыеЗаказы.СуммаДоставкиЗаМКАД
		            |					ИНАЧЕ ВЫБОР
		            |							КОГДА ЗакрытыеЗаказы.СуммаОценочная > 0
		            |								ТОГДА ЗакрытыеЗаказы.СуммаЧастичногоВозврата + ЗакрытыеЗаказы.СуммаДоставкиДоМКАД + ЗакрытыеЗаказы.СуммаДоставкиЗаМКАД
		            |							ИНАЧЕ 0
		            |						КОНЕЦ
		            |				КОНЕЦ
		            |		ИНАЧЕ ВЫБОР
		            |				КОГДА ЗакрытыеЗаказы.СуммаОценочная < 0
		            |					ТОГДА -ЗакрытыеЗаказы.СуммаОценочная
		            |				ИНАЧЕ ЗакрытыеЗаказы.СуммаЧастичногоВозврата
		            |			КОНЕЦ
		            |	КОНЕЦ КАК СтоимостьВозврата,
		            |	ВЫБОР
		            |		КОГДА ЗакрытыеЗаказы.СтатусИнтернетМагазина = ЗНАЧЕНИЕ(Справочник.СтатусЗаказаИнтернетМагазина.ЗаказОтклонен)
		            |				ИЛИ ЗакрытыеЗаказы.ПричинаНевыполнения.Ссылка В (ЗНАЧЕНИЕ(Справочник.ПричиныНевыполненияДоставки.ОтказКлиентаСЗаездом), ЗНАЧЕНИЕ(Справочник.ПричиныНевыполненияДоставки.ОтказКлиентаБезЗаезда), ЗНАЧЕНИЕ(Справочник.ПричиныНевыполненияДоставки.ПустаяСсылка))
		            |			ТОГДА 0
		            |		ИНАЧЕ ЗакрытыеЗаказы.КассовоеОбслуживание + ЗакрытыеЗаказы.БанковскаяКомиссия
		            |	КОНЕЦ КАК АгентскоеВознаграждение,
		            |	ВЫБОР
		            |		КОГДА ЗакрытыеЗаказы.СтатусИнтернетМагазина <> ЗНАЧЕНИЕ(Справочник.СтатусЗаказаИнтернетМагазина.ЗаказОтклонен)
		            |			ТОГДА ВЫБОР
		            |					КОГДА ЗакрытыеЗаказы.ТипОплаты = ЗНАЧЕНИЕ(Справочник.ТипыОплат.Наличные)
		            |							ИЛИ ЗакрытыеЗаказы.ТипОплаты = ЗНАЧЕНИЕ(Справочник.ТипыОплат.ВКредит)
		            |							ИЛИ ЗакрытыеЗаказы.ТипОплаты = ЗНАЧЕНИЕ(Справочник.ТипыОплат.Терминал)
		            |						ТОГДА ЗакрытыеЗаказы.ОплаченоКлиентовНал
		            |					ИНАЧЕ 0
		            |				КОНЕЦ
		            |		ИНАЧЕ 0
		            |	КОНЕЦ КАК СуммаПолученнаяОтПокупателей,
		            |	ВЫБОР
		            |		КОГДА ЗакрытыеЗаказы.СтатусИнтернетМагазина = ЗНАЧЕНИЕ(Справочник.СтатусЗаказаИнтернетМагазина.ЗаказОтклонен)
		            |				ИЛИ ЗакрытыеЗаказы.ПричинаНевыполнения.Ссылка В (ЗНАЧЕНИЕ(Справочник.ПричиныНевыполненияДоставки.ОтказКлиентаБезЗаезда), ЗНАЧЕНИЕ(Справочник.ПричиныНевыполненияДоставки.ПустаяСсылка))
		            |			ТОГДА 0
		            |		ИНАЧЕ ЗакрытыеЗаказы.УслугиСД
		            |	КОНЕЦ КАК СтоимостьДоставки,
		            |	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаПеречисления,
		            |	"""" КАК СтатусДоставки,
		            |	ГОД(ЗакрытыеЗаказы.Реализация.Дата) КАК ГодДоставки,
		            |	МЕСЯЦ(ЗакрытыеЗаказы.Реализация.Дата) КАК МесяцДоставки,
		            |	ДЕНЬ(ЗакрытыеЗаказы.Реализация.Дата) КАК ДеньДоставки,
		            |	ЗакрытыеЗаказы.СуммаДоставкиДоМКАД + ЗакрытыеЗаказы.СуммаДоставкиЗаМКАД КАК Доставка,
		            |	ЗакрытыеЗаказы.ПредоплатаПоКредиту,
		            |	ЗакрытиеЗаказовЗаказы.КомментарийСД,
		            |	ЗакрытыеЗаказы.ТипОплаты,
		            |	ЗакрытыеЗаказы.ТипЗаказа,
		            |	ЗакрытиеЗаказовЗаказы.Ссылка.Проведен
		            |ПОМЕСТИТЬ ВТДоставки
		            |ИЗ
		            |	ВТ_ЗакрытыеЗаказыОборот КАК ЗакрытыеЗаказы
		            |		ЛЕВОЕ СОЕДИНЕНИЕ ВТКоличества КАК ВТКоличества
		            |		ПО ЗакрытыеЗаказы.Реализация = ВТКоличества.Реализация
		            |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗакрытиеЗаказов.Заказы КАК ЗакрытиеЗаказовЗаказы
		            |		ПО ЗакрытыеЗаказы.Реализация.Ссылка = ЗакрытиеЗаказовЗаказы.Реализация.Ссылка
		            |			И (ЗакрытиеЗаказовЗаказы.Закрыть = ИСТИНА)
		            |ГДЕ
		            |	&УСЛОВИЕ_ТЕРМИНАЛ
		            |;
		            |
		            |////////////////////////////////////////////////////////////////////////////////
		            |ВЫБРАТЬ
		            |	ВТДоставки.ИнтернетМагазин,
		            |	ВТДоставки.Реализация,
		            |	ВТДоставки.НомерЗаказа,
		            |	ВТДоставки.НомерВнешнегоЗаказа КАК НомерВнешнегоЗаказа,
		            |	НАЧАЛОПЕРИОДА(ВТДоставки.ДатаДоставки, ДЕНЬ) КАК ДатаДоставки,
		            |	ВТДоставки.ДатаДоставки КАК ДатаДоставки2,
		            |	ВТДоставки.ВидРабот,
		            |	ВТДоставки.ДатаЗабора,
		            |	ВТДоставки.СтоимостьГруза,
		            |	ВТДоставки.СтоимостьВозврата,
		            |	ВТДоставки.АгентскоеВознаграждение,
		            |	ВТДоставки.СуммаПолученнаяОтПокупателей,
		            |	ВТДоставки.СтоимостьДоставки,
		            |	ВТДоставки.СтатусДоставки,
		            |	ВТОплаты.Дата КАК ДатаПеречисления,
		            |	ВТДоставки.Реализация.Ссылка КАК Док,
		            |	ВТДоставки.Доставка,
		            |	ВТДоставки.ПредоплатаПоКредиту,
		            |	ВТДоставки.КомментарийСД,
		            |	ВТДоставки.ТипОплаты,
		            |	ВТДоставки.ТипЗаказа
		            |ИЗ
		            |	ВТДоставки КАК ВТДоставки
		            |		ЛЕВОЕ СОЕДИНЕНИЕ ВТОплаты КАК ВТОплаты
		            |		ПО ВТДоставки.ГодДоставки = ВТОплаты.ГодДоставки
		            |			И ВТДоставки.МесяцДоставки = ВТОплаты.МесяцДоставки
		            |			И ВТДоставки.ДеньДоставки = ВТОплаты.ДеньДоставки
		            |ГДЕ
		            |	ВТДоставки.СтоимостьГруза >= 0
		            |	И ЕСТЬNULL(ВТДоставки.НомерВнешнегоЗаказа, ИСТИНА) <> ИСТИНА
		            |	И ВТДоставки.Проведен
		            |
		            |СГРУППИРОВАТЬ ПО
		            |	ВТДоставки.КомментарийСД,
		            |	ВТДоставки.СтатусДоставки,
		            |	ВТДоставки.НомерВнешнегоЗаказа,
		            |	ВТДоставки.ИнтернетМагазин,
		            |	ВТДоставки.ДатаЗабора,
		            |	ВТОплаты.Дата,
		            |	ВТДоставки.ТипЗаказа,
		            |	ВТДоставки.ДатаДоставки,
		            |	ВТДоставки.ВидРабот,
		            |	ВТДоставки.НомерЗаказа,
		            |	ВТДоставки.Реализация,
		            |	ВТДоставки.ТипОплаты,
		            |	НАЧАЛОПЕРИОДА(ВТДоставки.ДатаДоставки, ДЕНЬ),
		            |	ВТДоставки.СтоимостьГруза,
		            |	ВТДоставки.СтоимостьВозврата,
		            |	ВТДоставки.АгентскоеВознаграждение,
		            |	ВТДоставки.СтоимостьДоставки,
		            |	ВТДоставки.Доставка,
		            |	ВТДоставки.ПредоплатаПоКредиту,
		            |	ВТДоставки.Реализация.Ссылка,
		            |	ВТДоставки.СуммаПолученнаяОтПокупателей
		            |
		            |УПОРЯДОЧИТЬ ПО
		            |	ДатаДоставки,
		            |	НомерВнешнегоЗаказа
		            |;
		            |
		            |////////////////////////////////////////////////////////////////////////////////
		            |УНИЧТОЖИТЬ ВТОплаты
		            |;
		            |
		            |////////////////////////////////////////////////////////////////////////////////
		            |УНИЧТОЖИТЬ ВТДоставки
		            |;
		            |
		            |////////////////////////////////////////////////////////////////////////////////
		            |УНИЧТОЖИТЬ ВТКоличества";
		//
		//ЗакрытыеЗаказы.СуммаОценочная - ЗакрытыеЗаказы.СуммаЧастичногоВозврата = 0
		//|				ИЛИ
		
		Если ЗначениеЗаполнено(ТерминалДоставки) Тогда
			Зап.УстановитьПараметр("ТерминалДоставки", ТерминалДоставки);
			Зап.Текст = СтрЗаменить(Зап.Текст, "&УСЛОВИЕ_ТЕРМИНАЛ", "ЗакрытыеЗаказы.ТерминалДоставки = &ТерминалДоставки");
		Иначе
			Зап.Текст = СтрЗаменить(Зап.Текст, "&УСЛОВИЕ_ТЕРМИНАЛ", "ИСТИНА");
		КонецЕсли;
		
	
		Зап.УстановитьПараметр("НачПериода", НачалоДня(НачПериода));			
		Зап.УстановитьПараметр("КонПериода", КонецДня(КонПериода));
		Зап.УстановитьПараметр("Контрагент", Контрагент);
	Иначе
		Зап.Текст = "ВЫБРАТЬ
		            |	ЗакрытиеЗаказовТовары.Реализация,
		            |	СУММА(ЗакрытиеЗаказовТовары.Количество) КАК Количество
		            |ПОМЕСТИТЬ ВТКоличества
		            |ИЗ
		            |	Документ.ЗакрытиеЗаказов.Товары КАК ЗакрытиеЗаказовТовары
		            |ГДЕ
		            |	ЗакрытиеЗаказовТовары.Реализация.Дата МЕЖДУ &НачПериода И &КонПериода
		            |	И ЗакрытиеЗаказовТовары.Ссылка.Проведен = ИСТИНА
		            |
		            |СГРУППИРОВАТЬ ПО
		            |	ЗакрытиеЗаказовТовары.Реализация
		            |;
		            |
		            |////////////////////////////////////////////////////////////////////////////////
		            |ВЫБРАТЬ
		            |	ЗакрытыеЗаказы.ЮрЛицо,
		            |	ЗакрытыеЗаказы.ТипЗаказа,
		            |	ЗакрытыеЗаказы.Транспорт,
		            |	ЗакрытыеЗаказы.ИнтернетМагазин,
		            |	ЗакрытыеЗаказы.КатегорияДоставки,
		            |	ЗакрытыеЗаказы.Водитель,
		            |	ЗакрытыеЗаказы.Экспедитор,
		            |	ЗакрытыеЗаказы.Клиент,
		            |	ЗакрытыеЗаказы.Реализация,
		            |	ЗакрытыеЗаказы.ТипОплаты,
		            |	ЗакрытыеЗаказы.СтатусЗаказа,
		            |	ЗакрытыеЗаказы.ПричинаНевыполнения,
		            |	ЗакрытыеЗаказы.СтатусИнтернетМагазина,
		            |	ЗакрытыеЗаказы.ПричинаОтказа,
		            |	ЗакрытыеЗаказы.VIPДоставка,
		            |	ЗакрытыеЗаказы.ВидVip,
		            |	ЗакрытыеЗаказы.ТарифнаяСетка,
		            |	ЗакрытыеЗаказы.РасчетныйБрейк,
		            |	ЗакрытыеЗаказы.ТарифнаяСеткаПартнера,
		            |	ЗакрытыеЗаказы.ЗонаТарификации,
		            |	ЗакрытыеЗаказы.ПричинаОтклоненияЗаказа,
		            |	ЗакрытыеЗаказы.Партнер,
		            |	ЗакрытыеЗаказы.ТерминалДоставки,
		            |	ЗакрытыеЗаказы.ТерминалПриёма,
		            |	ЗакрытыеЗаказы.ОбъемныйБрейк,
		            |	СУММА(ЗакрытыеЗаказы.СуммаОценочная) КАК СуммаОценочная,
		            |	СУММА(ЗакрытыеЗаказы.СуммаПолученная) КАК СуммаПолученная,
		            |	СУММА(ЗакрытыеЗаказы.СуммаДоставкиДоМКАД) КАК СуммаДоставкиДоМКАД,
		            |	СУММА(ЗакрытыеЗаказы.СуммаДоставкиЗаМКАД) КАК СуммаДоставкиЗаМКАД,
		            |	СУММА(ЗакрытыеЗаказы.УслугиСД) КАК УслугиСД,
		            |	СУММА(ЗакрытыеЗаказы.БанковскаяКомиссия) КАК БанковскаяКомиссия,
		            |	СУММА(ЗакрытыеЗаказы.КассовоеОбслуживание) КАК КассовоеОбслуживание,
		            |	СУММА(ЗакрытыеЗаказы.СуммаВозврата) КАК СуммаВозврата,
		            |	СУММА(ЗакрытыеЗаказы.Масса) КАК Масса,
		            |	СУММА(ЗакрытыеЗаказы.СуммаЧастичногоВозврата) КАК СуммаЧастичногоВозврата,
		            |	СУММА(ЗакрытыеЗаказы.ОплаченоКлиентовНал) КАК ОплаченоКлиентовНал,
		            |	СУММА(ЗакрытыеЗаказы.АгентскоеВознаграждение) КАК АгентскоеВознаграждение,
		            |	СУММА(ЗакрытыеЗаказы.ПредоплатаПоКредиту) КАК ПредоплатаПоКредиту,
		            |	СУММА(ЗакрытыеЗаказы.УслугиСДЧистые) КАК УслугиСДЧистые,
		            |	СУММА(ЗакрытыеЗаказы.СтраховойСбор) КАК СтраховойСбор,
		            |	СУММА(ЗакрытыеЗаказы.ФактическийВес) КАК ФактическийВес,
		            |	СУММА(ЗакрытыеЗаказы.ОбъемЗабора) КАК ОбъемЗабора,
		            |	СУММА(ЗакрытыеЗаказы.ОбъемЗабораПоЗаказам) КАК ОбъемЗабораПоЗаказам,
		            |	СУММА(ЗакрытыеЗаказы.ВыгруженныйОбъем) КАК ВыгруженныйОбъем,
		            |	ЗакрытыеЗаказы.Поступление,
		            |	ЗакрытыеЗаказы.Списание,
		            |	ЗакрытыеЗаказы.Оприходование,
		            |	ЗакрытыеЗаказы.Перемещение,
		            |	ЗакрытыеЗаказы.Доставка,
		            |	ЗакрытыеЗаказы.Возврат,
		            |	ЗакрытыеЗаказы.ПризнакВозврата,
		            |	ЗакрытыеЗаказы.ОценочнаяСтоимость КАК ОценочнаяСтоимость
		            |ПОМЕСТИТЬ ВТ_ЗакрытыеЗаказыОборот
		            |ИЗ
		            |	РегистрНакопления.ЗакрытыеЗаказы КАК ЗакрытыеЗаказы
		            |ГДЕ
		            |	ЗакрытыеЗаказы.Период МЕЖДУ &НачПериода И &КонПериода
		            |	И ЗакрытыеЗаказы.ИнтернетМагазин = &Контрагент
		            |	И ЗакрытыеЗаказы.ТипЗаказа.Ссылка В (ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Доставка), ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Забор), ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Фрахт), ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Забор), ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Самовывоз))
		            |
		            |СГРУППИРОВАТЬ ПО
		            |	ЗакрытыеЗаказы.Экспедитор,
		            |	ЗакрытыеЗаказы.ПричинаОтклоненияЗаказа,
		            |	ЗакрытыеЗаказы.ТарифнаяСеткаПартнера,
		            |	ЗакрытыеЗаказы.КатегорияДоставки,
		            |	ЗакрытыеЗаказы.ТипЗаказа,
		            |	ЗакрытыеЗаказы.Реализация,
		            |	ЗакрытыеЗаказы.ЮрЛицо,
		            |	ЗакрытыеЗаказы.ЗонаТарификации,
		            |	ЗакрытыеЗаказы.ПричинаОтказа,
		            |	ЗакрытыеЗаказы.ПричинаНевыполнения,
		            |	ЗакрытыеЗаказы.ИнтернетМагазин,
		            |	ЗакрытыеЗаказы.ТерминалДоставки,
		            |	ЗакрытыеЗаказы.Клиент,
		            |	ЗакрытыеЗаказы.ТарифнаяСетка,
		            |	ЗакрытыеЗаказы.СтатусИнтернетМагазина,
		            |	ЗакрытыеЗаказы.Партнер,
		            |	ЗакрытыеЗаказы.VIPДоставка,
		            |	ЗакрытыеЗаказы.РасчетныйБрейк,
		            |	ЗакрытыеЗаказы.ТерминалПриёма,
		            |	ЗакрытыеЗаказы.Поступление,
		            |	ЗакрытыеЗаказы.Оприходование,
		            |	ЗакрытыеЗаказы.Списание,
		            |	ЗакрытыеЗаказы.Перемещение,
		            |	ЗакрытыеЗаказы.ОбъемныйБрейк,
		            |	ЗакрытыеЗаказы.ПризнакВозврата,
		            |	ЗакрытыеЗаказы.Доставка,
		            |	ЗакрытыеЗаказы.Возврат,
		            |	ЗакрытыеЗаказы.ВидVip,
		            |	ЗакрытыеЗаказы.СтатусЗаказа,
		            |	ЗакрытыеЗаказы.Водитель,
		            |	ЗакрытыеЗаказы.Транспорт,
		            |	ЗакрытыеЗаказы.ТипОплаты,
		            |	ЗакрытыеЗаказы.ОценочнаяСтоимость
		            |;
		            |
		            |////////////////////////////////////////////////////////////////////////////////
		            |ВЫБРАТЬ
		            |	МИНИМУМ(ПлатежноеПоручениеИсходящееТаблицаДатОплат.Ссылка.Дата) КАК Дата,
		            |	ГОД(ПлатежноеПоручениеИсходящееТаблицаДатОплат.ДатаДоставки) КАК ГодДоставки,
		            |	МЕСЯЦ(ПлатежноеПоручениеИсходящееТаблицаДатОплат.ДатаДоставки) КАК МесяцДоставки,
		            |	ДЕНЬ(ПлатежноеПоручениеИсходящееТаблицаДатОплат.ДатаДоставки) КАК ДеньДоставки
		            |ПОМЕСТИТЬ ВТОплаты
		            |ИЗ
		            |	Документ.ПлатежноеПоручениеИсходящее.ТаблицаДатОплат КАК ПлатежноеПоручениеИсходящееТаблицаДатОплат
		            |ГДЕ
		            |	ПлатежноеПоручениеИсходящееТаблицаДатОплат.Ссылка.Проведен = ИСТИНА
		            |	И ПлатежноеПоручениеИсходящееТаблицаДатОплат.Ссылка.Контрагент = &Контрагент
		            |	И ПлатежноеПоручениеИсходящееТаблицаДатОплат.ДатаДоставки МЕЖДУ &НачПериода И &КонПериода
		            |
		            |СГРУППИРОВАТЬ ПО
		            |	ГОД(ПлатежноеПоручениеИсходящееТаблицаДатОплат.ДатаДоставки),
		            |	МЕСЯЦ(ПлатежноеПоручениеИсходящееТаблицаДатОплат.ДатаДоставки),
		            |	ДЕНЬ(ПлатежноеПоручениеИсходящееТаблицаДатОплат.ДатаДоставки)
		            |;
		            |
		            |////////////////////////////////////////////////////////////////////////////////
		            |ВЫБРАТЬ
		            |	ЗакрытыеЗаказы.ИнтернетМагазин,
		            |	ЗакрытыеЗаказы.Реализация,
		            |	ЗакрытыеЗаказы.Реализация.Номер КАК НомерЗаказа,
		            |	ЗакрытыеЗаказы.Реализация.НомерВнешнегоЗаказа КАК НомерВнешнегоЗаказа,
		            |	ЗакрытыеЗаказы.Реализация.Дата КАК ДатаДоставки,
		            |	ВЫБОР
		            |		КОГДА ЗакрытыеЗаказы.ТипЗаказа <> ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Самовывоз)
		            |			ТОГДА ВЫБОР
		            |					КОГДА ЗакрытыеЗаказы.ПричинаНевыполнения.Ссылка В (ЗНАЧЕНИЕ(Справочник.ПричиныНевыполненияДоставки.ОтказКлиентаСЗаездом), ЗНАЧЕНИЕ(Справочник.ПричиныНевыполненияДоставки.ОтказКлиентаБезЗаезда), ЗНАЧЕНИЕ(Справочник.ПричиныНевыполненияДоставки.ПустаяСсылка))
		            |						ТОГДА ""ОТКАЗ""
		            |					ИНАЧЕ ВЫБОР
		            |							КОГДА ЗакрытыеЗаказы.ТипЗаказа = ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Забор)
		            |								ТОГДА ""ЗАБОР""
		            |							ИНАЧЕ ВЫБОР
		            |									КОГДА ЗакрытыеЗаказы.ТипЗаказа = ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Доставка)
		            |											ИЛИ ЗакрытыеЗаказы.ТипЗаказа = ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Фрахт)
		            |										ТОГДА ВЫБОР
		            |												КОГДА ЗакрытыеЗаказы.СуммаОценочная = 0
		            |														И ВТКоличества.Количество = 0
		            |													ТОГДА ""ОБМЕН""
		            |												ИНАЧЕ ВЫБОР
		            |														КОГДА ЗакрытыеЗаказы.СуммаОценочная < 0
		            |															ТОГДА ""ВОЗВРАТ""
		            |														ИНАЧЕ ""ДОСТАВКА""
		            |													КОНЕЦ
		            |											КОНЕЦ
		            |									ИНАЧЕ """"
		            |								КОНЕЦ
		            |						КОНЕЦ
		            |				КОНЕЦ
		            |		ИНАЧЕ ""САМОВЫВОЗ""
		            |	КОНЕЦ КАК ВидРабот,
		            |	ЗакрытыеЗаказы.Доставка.ДатаСоздания КАК ДатаЗабора,
		            |	ВЫБОР
		            |		КОГДА ЗакрытыеЗаказы.СуммаОценочная >= 0
		            |			ТОГДА ЗакрытыеЗаказы.СуммаОценочная + ЗакрытыеЗаказы.СуммаДоставкиДоМКАД + ЗакрытыеЗаказы.СуммаДоставкиЗаМКАД
		            |		ИНАЧЕ -ЗакрытыеЗаказы.СуммаОценочная + ЗакрытыеЗаказы.СуммаДоставкиДоМКАД + ЗакрытыеЗаказы.СуммаДоставкиЗаМКАД
		            |	КОНЕЦ КАК СтоимостьГруза,
		            |	ВЫБОР
		            |		КОГДА ЗакрытыеЗаказы.СуммаЧастичногоВозврата = ЗакрытыеЗаказы.СуммаОценочная
		            |			ТОГДА ВЫБОР
		            |					КОГДА ЗакрытыеЗаказы.СуммаОценочная < 0
		            |						ТОГДА -ЗакрытыеЗаказы.СуммаЧастичногоВозврата - ЗакрытыеЗаказы.СуммаДоставкиДоМКАД - ЗакрытыеЗаказы.СуммаДоставкиЗаМКАД
		            |					ИНАЧЕ ВЫБОР
		            |							КОГДА ЗакрытыеЗаказы.СуммаОценочная > 0
		            |								ТОГДА ЗакрытыеЗаказы.СуммаЧастичногоВозврата + ЗакрытыеЗаказы.СуммаДоставкиДоМКАД + ЗакрытыеЗаказы.СуммаДоставкиЗаМКАД
		            |							ИНАЧЕ 0
		            |						КОНЕЦ
		            |				КОНЕЦ
		            |		ИНАЧЕ ВЫБОР
		            |				КОГДА ЗакрытыеЗаказы.СуммаОценочная < 0
		            |					ТОГДА -ЗакрытыеЗаказы.СуммаОценочная
		            |				ИНАЧЕ ЗакрытыеЗаказы.СуммаЧастичногоВозврата
		            |			КОНЕЦ
		            |	КОНЕЦ КАК СтоимостьВозврата,
		            |	ВЫБОР
		            |		КОГДА ЗакрытыеЗаказы.СтатусИнтернетМагазина = ЗНАЧЕНИЕ(Справочник.СтатусЗаказаИнтернетМагазина.ЗаказОтклонен)
		            |				ИЛИ ЗакрытыеЗаказы.ПричинаНевыполнения.Ссылка В (ЗНАЧЕНИЕ(Справочник.ПричиныНевыполненияДоставки.ОтказКлиентаСЗаездом), ЗНАЧЕНИЕ(Справочник.ПричиныНевыполненияДоставки.ОтказКлиентаБезЗаезда), ЗНАЧЕНИЕ(Справочник.ПричиныНевыполненияДоставки.ПустаяСсылка))
		            |			ТОГДА 0
		            |		ИНАЧЕ ЗакрытыеЗаказы.КассовоеОбслуживание + ЗакрытыеЗаказы.БанковскаяКомиссия
		            |	КОНЕЦ КАК АгентскоеВознаграждение,
		            |	ВЫБОР
		            |		КОГДА ЗакрытыеЗаказы.ТипОплаты = ЗНАЧЕНИЕ(Справочник.ТипыОплат.Наличные)
		            |				ИЛИ ЗакрытыеЗаказы.ТипОплаты = ЗНАЧЕНИЕ(Справочник.ТипыОплат.ВКредит)
		            |				ИЛИ ЗакрытыеЗаказы.ТипОплаты = ЗНАЧЕНИЕ(Справочник.ТипыОплат.Терминал)
		            |			ТОГДА ЗакрытыеЗаказы.ОплаченоКлиентовНал
		            |		ИНАЧЕ 0
		            |	КОНЕЦ КАК СуммаПолученнаяОтПокупателей,
		            |	ВЫБОР
		            |		КОГДА ЗакрытыеЗаказы.СтатусИнтернетМагазина = ЗНАЧЕНИЕ(Справочник.СтатусЗаказаИнтернетМагазина.ЗаказОтклонен)
		            |				ИЛИ ЗакрытыеЗаказы.ПричинаНевыполнения.Ссылка В (ЗНАЧЕНИЕ(Справочник.ПричиныНевыполненияДоставки.ОтказКлиентаБезЗаезда), ЗНАЧЕНИЕ(Справочник.ПричиныНевыполненияДоставки.ПустаяСсылка))
		            |			ТОГДА 0
		            |		ИНАЧЕ ЗакрытыеЗаказы.УслугиСД
		            |	КОНЕЦ КАК СтоимостьДоставки,
		            |	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаПеречисления,
		            |	"""" КАК СтатусДоставки,
		            |	ГОД(ЗакрытыеЗаказы.Реализация.Дата) КАК ГодДоставки,
		            |	МЕСЯЦ(ЗакрытыеЗаказы.Реализация.Дата) КАК МесяцДоставки,
		            |	ДЕНЬ(ЗакрытыеЗаказы.Реализация.Дата) КАК ДеньДоставки,
		            |	ЗакрытыеЗаказы.СуммаДоставкиДоМКАД + ЗакрытыеЗаказы.СуммаДоставкиЗаМКАД КАК Доставка,
		            |	ЗакрытыеЗаказы.ПредоплатаПоКредиту,
		            |	ЗакрытиеЗаказовЗаказы.КомментарийСД,
		            |	ЗакрытыеЗаказы.ТипОплаты,
		            |	ЗакрытыеЗаказы.ТипЗаказа
		            |ПОМЕСТИТЬ ВТДоставки
		            |ИЗ
		            |	ВТ_ЗакрытыеЗаказыОборот КАК ЗакрытыеЗаказы
		            |		ЛЕВОЕ СОЕДИНЕНИЕ ВТКоличества КАК ВТКоличества
		            |		ПО ЗакрытыеЗаказы.Реализация = ВТКоличества.Реализация
		            |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗакрытиеЗаказов.Заказы КАК ЗакрытиеЗаказовЗаказы
		            |		ПО ЗакрытыеЗаказы.Реализация.Ссылка = ЗакрытиеЗаказовЗаказы.Реализация.Ссылка
		            |			И (ЗакрытиеЗаказовЗаказы.Закрыть = ИСТИНА)
		            |ГДЕ
		            |	&УСЛОВИЕ_ТЕРМИНАЛ
		            |;
		            |
		            |////////////////////////////////////////////////////////////////////////////////
		            |ВЫБРАТЬ
		            |	ВТДоставки.ИнтернетМагазин,
		            |	ВТДоставки.Реализация,
		            |	ВТДоставки.НомерЗаказа,
		            |	ВТДоставки.НомерВнешнегоЗаказа КАК НомерВнешнегоЗаказа,
		            |	НАЧАЛОПЕРИОДА(ВТДоставки.ДатаДоставки, ДЕНЬ) КАК ДатаДоставки,
		            |	ВТДоставки.ДатаДоставки КАК ДатаДоставки2,
		            |	ВТДоставки.ВидРабот,
		            |	ВТДоставки.ДатаЗабора,
		            |	ВТДоставки.СтоимостьГруза,
		            |	ВТДоставки.СтоимостьВозврата,
		            |	ВТДоставки.АгентскоеВознаграждение,
		            |	ВТДоставки.СуммаПолученнаяОтПокупателей,
		            |	ВТДоставки.СтоимостьДоставки,
		            |	ВТДоставки.СтатусДоставки,
		            |	ВТОплаты.Дата КАК ДатаПеречисления,
		            |	ВТДоставки.Реализация.Ссылка КАК Док,
		            |	ВТДоставки.Доставка,
		            |	МАКСИМУМ(1) КАК ВидДанных,
		            |	МАКСИМУМ(0) КАК ИтРеал,
		            |	ВТДоставки.ПредоплатаПоКредиту,
		            |	ВТДоставки.КомментарийСД,
		            |	ВТДоставки.ТипОплаты,
		            |	ВТДоставки.ТипЗаказа
		            |ИЗ
		            |	ВТДоставки КАК ВТДоставки
		            |		ЛЕВОЕ СОЕДИНЕНИЕ ВТОплаты КАК ВТОплаты
		            |		ПО ВТДоставки.ГодДоставки = ВТОплаты.ГодДоставки
		            |			И ВТДоставки.МесяцДоставки = ВТОплаты.МесяцДоставки
		            |			И ВТДоставки.ДеньДоставки = ВТОплаты.ДеньДоставки
		            |ГДЕ
		            |	ВТДоставки.СтоимостьГруза >= 0
		            |	И ЕСТЬNULL(ВТДоставки.НомерВнешнегоЗаказа, ИСТИНА) <> ИСТИНА
		            |
		            |СГРУППИРОВАТЬ ПО
		            |	ВТДоставки.ДатаДоставки,
		            |	ВТДоставки.НомерВнешнегоЗаказа,
		            |	ВТДоставки.ДатаЗабора,
		            |	ВТДоставки.НомерЗаказа,
		            |	ВТДоставки.ТипЗаказа,
		            |	ВТДоставки.КомментарийСД,
		            |	ВТДоставки.Реализация,
		            |	ВТДоставки.ВидРабот,
		            |	ВТОплаты.Дата,
		            |	ВТДоставки.СтатусДоставки,
		            |	ВТДоставки.ИнтернетМагазин,
		            |	ВТДоставки.ТипОплаты,
		            |	НАЧАЛОПЕРИОДА(ВТДоставки.ДатаДоставки, ДЕНЬ),
		            |	ВТДоставки.СтоимостьГруза,
		            |	ВТДоставки.СтоимостьВозврата,
		            |	ВТДоставки.АгентскоеВознаграждение,
		            |	ВТДоставки.СуммаПолученнаяОтПокупателей,
		            |	ВТДоставки.СтоимостьДоставки,
		            |	ВТДоставки.Реализация.Ссылка,
		            |	ВТДоставки.Доставка,
		            |	ВТДоставки.ПредоплатаПоКредиту
		            |
		            |ОБЪЕДИНИТЬ ВСЕ
		            |
		            |ВЫБРАТЬ
		            |	"""",
		            |	NULL,
		            |	ОтчетПоМнениюПартнера.НомерСтроки,
		            |	ОтчетПоМнениюПартнера.НомерЗаказа,
		            |	ОтчетПоМнениюПартнера.Период,
		            |	ОтчетПоМнениюПартнера.Период,
		            |	ОтчетПоМнениюПартнера.СтроковыйПараметр1,
		            |	ОтчетПоМнениюПартнера.ПараметрДаты1,
		            |	ОтчетПоМнениюПартнера.Сумма1,
		            |	ОтчетПоМнениюПартнера.Сумма2,
		            |	ОтчетПоМнениюПартнера.Сумма4,
		            |	ОтчетПоМнениюПартнера.Сумма5,
		            |	ОтчетПоМнениюПартнера.Сумма6,
		            |	"""",
		            |	ОтчетПоМнениюПартнера.ПараметрДаты2,
		            |	ОтчетПоМнениюПартнера.Заказ,
		            |	ОтчетПоМнениюПартнера.КорСум,
		            |	2,
		            |	ОтчетПоМнениюПартнера.Сумма3,
		            |	NULL,
		            |	"""",
		            |	NULL,
		            |	NULL
		            |ИЗ
		            |	РегистрНакопления.ОтчетПоМнениюПартнера КАК ОтчетПоМнениюПартнера
		            |ГДЕ
		            |	ОтчетПоМнениюПартнера.Период МЕЖДУ &НачПериода2 И &КонПериода2
		            |	И ОтчетПоМнениюПартнера.Партнер = &Контрагент
		            |
		            |УПОРЯДОЧИТЬ ПО
		            |	ДатаДоставки,
		            |	НомерВнешнегоЗаказа
		            |;
		            |
		            |////////////////////////////////////////////////////////////////////////////////
		            |УНИЧТОЖИТЬ ВТОплаты
		            |;
		            |
		            |////////////////////////////////////////////////////////////////////////////////
		            |УНИЧТОЖИТЬ ВТДоставки
		            |;
		            |
		            |////////////////////////////////////////////////////////////////////////////////
		            |УНИЧТОЖИТЬ ВТКоличества";
		//
		//ЗакрытыеЗаказы.СуммаОценочная - ЗакрытыеЗаказы.СуммаЧастичногоВозврата = 0
		//|				ИЛИ
		
		Если ЗначениеЗаполнено(ТерминалДоставки) Тогда
			Зап.УстановитьПараметр("ТерминалДоставки", ТерминалДоставки);
			Зап.Текст = СтрЗаменить(Зап.Текст, "&УСЛОВИЕ_ТЕРМИНАЛ", "ЗакрытыеЗаказы.ТерминалДоставки = &ТерминалДоставки");
		Иначе
			Зап.Текст = СтрЗаменить(Зап.Текст, "&УСЛОВИЕ_ТЕРМИНАЛ", "ИСТИНА");
		КонецЕсли;
		
		
		Зап.УстановитьПараметр("НачПериода2", НачалоДня(НачПериода));			
		Зап.УстановитьПараметр("КонПериода2", КонецДня(МаксДПМП));
		
		Зап.УстановитьПараметр("НачПериода", НачалоДня(МаксДПМП) + 86400);			
		Зап.УстановитьПараметр("КонПериода", КонецДня(КонПериода));
		
		Зап.УстановитьПараметр("Контрагент", Контрагент);	
	КонецЕсли;
	
	Рез = Зап.Выполнить().Выгрузить();
	
	Если Сравнение Тогда
		Мак = ПолучитьМакет("Макет1");
	Иначе	
		Мак = ПолучитьМакет("Макет");
	КонецЕсли;	
	
	ОблШ = Мак.ПолучитьОбласть("Шапка");
	ОблС = Мак.ПолучитьОбласть("Строка");
	ОблСП = Мак.ПолучитьОбласть("СтрокаОтчетПартнера");
	
	Таб.Вывести(ОблШ);
	
	НПП = 1;
	ИтСтГ = 0;
	ИтСтВ = 0;
	ИтСумР = 0;
	ИтСтДос= 0;
	ИтСумПол = 0;
	ИтСумПол_ = 0;
	ИтАг = 0;
	
	
	таб2 = Рез.Скопировать();
	Для Каждого Тек Из Таб2 Цикл
		Тек.НомерВнешнегоЗаказа = Прав(Тек.НомерВнешнегоЗаказа, 8);
	КонецЦикла;	
	
	//Таб2.Свернуть("НомерВнешнегоЗаказа, НомерЗаказа, ДатаДоставки, ДатаДоставки2", "СтоимостьВозврата, СтоимостьГруза");
	
	ЗапОбмены = Новый Запрос;
	ЗапОбмены.Текст = "ВЫБРАТЬ
	                  |	ЗакрытыеЗаказы.Период,
	                  |	ЗакрытыеЗаказы.Регистратор,
	                  |	ЗакрытыеЗаказы.ЮрЛицо,
	                  |	ЗакрытыеЗаказы.ТипЗаказа,
	                  |	ЗакрытыеЗаказы.Транспорт,
	                  |	ЗакрытыеЗаказы.ИнтернетМагазин,
	                  |	ЗакрытыеЗаказы.КатегорияДоставки,
	                  |	ЗакрытыеЗаказы.Водитель,
	                  |	ЗакрытыеЗаказы.Экспедитор,
	                  |	ЗакрытыеЗаказы.Клиент,
	                  |	ЗакрытыеЗаказы.Реализация,
	                  |	ЗакрытыеЗаказы.ТипОплаты,
	                  |	ЗакрытыеЗаказы.СтатусЗаказа,
	                  |	ЗакрытыеЗаказы.ПричинаНевыполнения,
	                  |	ЗакрытыеЗаказы.СтатусИнтернетМагазина,
	                  |	ЗакрытыеЗаказы.ПричинаОтказа,
	                  |	ЗакрытыеЗаказы.VIPДоставка,
	                  |	ЗакрытыеЗаказы.ВидVip,
	                  |	ЗакрытыеЗаказы.ТарифнаяСетка,
	                  |	ЗакрытыеЗаказы.РасчетныйБрейк,
	                  |	ЗакрытыеЗаказы.ТарифнаяСеткаПартнера,
	                  |	ЗакрытыеЗаказы.ЗонаТарификации,
	                  |	ЗакрытыеЗаказы.ПричинаОтклоненияЗаказа,
	                  |	ЗакрытыеЗаказы.Партнер,
	                  |	ЗакрытыеЗаказы.ТерминалДоставки,
	                  |	ЗакрытыеЗаказы.ТерминалПриёма,
	                  |	ЗакрытыеЗаказы.ОбъемныйБрейк,
	                  |	СУММА(ЗакрытыеЗаказы.СуммаОценочная) КАК СуммаОценочная,
	                  |	СУММА(ЗакрытыеЗаказы.СуммаПолученная) КАК СуммаПолученная,
	                  |	СУММА(ЗакрытыеЗаказы.СуммаДоставкиДоМКАД) КАК СуммаДоставкиДоМКАД,
	                  |	СУММА(ЗакрытыеЗаказы.СуммаДоставкиЗаМКАД) КАК СуммаДоставкиЗаМКАД,
	                  |	СУММА(ЗакрытыеЗаказы.УслугиСД) КАК УслугиСД,
	                  |	СУММА(ЗакрытыеЗаказы.БанковскаяКомиссия) КАК БанковскаяКомиссия,
	                  |	СУММА(ЗакрытыеЗаказы.КассовоеОбслуживание) КАК КассовоеОбслуживание,
	                  |	СУММА(ЗакрытыеЗаказы.СуммаВозврата) КАК СуммаВозврата,
	                  |	СУММА(ЗакрытыеЗаказы.Масса) КАК Масса,
	                  |	СУММА(ЗакрытыеЗаказы.СуммаЧастичногоВозврата) КАК СуммаЧастичногоВозврата,
	                  |	СУММА(ЗакрытыеЗаказы.ОплаченоКлиентовНал) КАК ОплаченоКлиентовНал,
	                  |	СУММА(ЗакрытыеЗаказы.АгентскоеВознаграждение) КАК АгентскоеВознаграждение,
	                  |	СУММА(ЗакрытыеЗаказы.ПредоплатаПоКредиту) КАК ПредоплатаПоКредиту,
	                  |	СУММА(ЗакрытыеЗаказы.УслугиСДЧистые) КАК УслугиСДЧистые,
	                  |	СУММА(ЗакрытыеЗаказы.СтраховойСбор) КАК СтраховойСбор,
	                  |	СУММА(ЗакрытыеЗаказы.ФактическийВес) КАК ФактическийВес,
	                  |	СУММА(ЗакрытыеЗаказы.ОбъемЗабора) КАК ОбъемЗабора,
	                  |	СУММА(ЗакрытыеЗаказы.ОбъемЗабораПоЗаказам) КАК ОбъемЗабораПоЗаказам,
	                  |	СУММА(ЗакрытыеЗаказы.ВыгруженныйОбъем) КАК ВыгруженныйОбъем,
	                  |	ЗакрытыеЗаказы.Поступление,
	                  |	ЗакрытыеЗаказы.Списание,
	                  |	ЗакрытыеЗаказы.Оприходование,
	                  |	ЗакрытыеЗаказы.Перемещение,
	                  |	ЗакрытыеЗаказы.Доставка,
	                  |	ЗакрытыеЗаказы.Возврат,
	                  |	ЗакрытыеЗаказы.ПризнакВозврата,
	                  |	СУММА(ЗакрытыеЗаказы.ОценочнаяСтоимость) КАК ОценочнаяСтоимость,
	                  |	ЗакрытыеЗаказы.Корректировка
	                  |ПОМЕСТИТЬ ВТ_ЗакрытыеЗаказыОборот
	                  |ИЗ
	                  |	РегистрНакопления.ЗакрытыеЗаказы КАК ЗакрытыеЗаказы
	                  |ГДЕ
	                  |	ЗакрытыеЗаказы.Период МЕЖДУ &НачДата И &КонДата
	                  |	И ЗакрытыеЗаказы.ИнтернетМагазин.Ссылка = &Контрагент
	                  |
	                  |СГРУППИРОВАТЬ ПО
	                  |	ЗакрытыеЗаказы.Перемещение,
	                  |	ЗакрытыеЗаказы.ТипОплаты,
	                  |	ЗакрытыеЗаказы.Поступление,
	                  |	ЗакрытыеЗаказы.ПричинаОтказа,
	                  |	ЗакрытыеЗаказы.ЗонаТарификации,
	                  |	ЗакрытыеЗаказы.РасчетныйБрейк,
	                  |	ЗакрытыеЗаказы.Оприходование,
	                  |	ЗакрытыеЗаказы.ТарифнаяСетка,
	                  |	ЗакрытыеЗаказы.Списание,
	                  |	ЗакрытыеЗаказы.ОбъемныйБрейк,
	                  |	ЗакрытыеЗаказы.ТерминалПриёма,
	                  |	ЗакрытыеЗаказы.ТерминалДоставки,
	                  |	ЗакрытыеЗаказы.Партнер,
	                  |	ЗакрытыеЗаказы.ПричинаОтклоненияЗаказа,
	                  |	ЗакрытыеЗаказы.Возврат,
	                  |	ЗакрытыеЗаказы.СтатусЗаказа,
	                  |	ЗакрытыеЗаказы.Реализация,
	                  |	ЗакрытыеЗаказы.Экспедитор,
	                  |	ЗакрытыеЗаказы.СтатусИнтернетМагазина,
	                  |	ЗакрытыеЗаказы.ПризнакВозврата,
	                  |	ЗакрытыеЗаказы.Корректировка,
	                  |	ЗакрытыеЗаказы.VIPДоставка,
	                  |	ЗакрытыеЗаказы.Доставка,
	                  |	ЗакрытыеЗаказы.ВидVip,
	                  |	ЗакрытыеЗаказы.ПричинаНевыполнения,
	                  |	ЗакрытыеЗаказы.Клиент,
	                  |	ЗакрытыеЗаказы.ТарифнаяСеткаПартнера,
	                  |	ЗакрытыеЗаказы.ЮрЛицо,
	                  |	ЗакрытыеЗаказы.ТипЗаказа,
	                  |	ЗакрытыеЗаказы.Регистратор,
	                  |	ЗакрытыеЗаказы.Водитель,
	                  |	ЗакрытыеЗаказы.КатегорияДоставки,
	                  |	ЗакрытыеЗаказы.Транспорт,
	                  |	ЗакрытыеЗаказы.ИнтернетМагазин,
	                  |	ЗакрытыеЗаказы.Период
	                  |;
	                  |
	                  |////////////////////////////////////////////////////////////////////////////////
	                  |ВЫБРАТЬ
	                  |	СУММА(ЗакрытиеЗаказовТовары.Сумма) КАК СуммаТоваров,
	                  |	СУММА(ВозвратТоваровОтПокупателяТовары.Сумма) КАК СуммаВозврата,
	                  |	ЗакрытыеЗаказы.Реализация.НомерВнешнегоЗаказа КАК НомерВнешнегоЗаказа
	                  |ИЗ
	                  |	ВТ_ЗакрытыеЗаказыОборот КАК ЗакрытыеЗаказы
	                  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВозвратТоваровОтПокупателя.Товары КАК ВозвратТоваровОтПокупателяТовары
	                  |		ПО ЗакрытыеЗаказы.Возврат.Ссылка = ВозвратТоваровОтПокупателяТовары.Ссылка.Ссылка
	                  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗакрытиеЗаказов.Товары КАК ЗакрытиеЗаказовТовары
	                  |		ПО ЗакрытыеЗаказы.Регистратор.Ссылка = ЗакрытиеЗаказовТовары.Ссылка.Ссылка
	                  |			И ЗакрытыеЗаказы.Реализация.Ссылка = ЗакрытиеЗаказовТовары.Реализация.Ссылка
	                  |			И (ЗакрытиеЗаказовТовары.Ссылка.Проведен)
	                  |ГДЕ
	                  |	ЗакрытиеЗаказовТовары.Количество > 0
	                  |	И &УСЛОВИЕ_ТЕРМИНАЛ
	                  |
	                  |СГРУППИРОВАТЬ ПО
	                  |	ЗакрытыеЗаказы.Реализация.НомерВнешнегоЗаказа";
					  
	Если ЗначениеЗаполнено(ТерминалДоставки) Тогда
		ЗапОбмены.УстановитьПараметр("ТерминалДоставки", ТерминалДоставки);
		ЗапОбмены.Текст = СтрЗаменить(ЗапОбмены.Текст, "&УСЛОВИЕ_ТЕРМИНАЛ", "ЗакрытыеЗаказы.ТерминалДоставки = &ТерминалДоставки");
	Иначе
		ЗапОбмены.Текст = СтрЗаменить(ЗапОбмены.Текст, "&УСЛОВИЕ_ТЕРМИНАЛ", "ИСТИНА");
	КонецЕсли;				  
					  
					  
	ЗапОбмены.УстановитьПараметр("НачДата", НачалоДня(НачПериода));			
	ЗапОбмены.УстановитьПараметр("КонДата", КонецДня(КонПериода));
	ЗапОбмены.УстановитьПараметр("Контрагент", Контрагент);
	РезОбмены = ЗапОбмены.Выполнить().Выгрузить();
	
	Рез = Зап.Выполнить().Выгрузить();
	Сч = 0;				  
	
	Если Не Сравнение Тогда
		Если ЗначениеЗаполнено(ДокОтчет) Тогда
			Док = ДокОтчет.ПолучитьОбъект();
			Док.Заказы.Очистить();
			Док.НачалоПериода = НачПериода;
			Док.КонецПериода = КонПериода;
		Иначе
			Док = Неопределено;
		КонецЕсли;	
	Иначе
		Док = ДокОтчет;
	КонецеСли;
		
	МасСтр = Новый Массив;
	МассУже = Новый Массив;
	Для Каждого Тек Из Рез Цикл
		
		Если СтрокаНомеров <> Неопределено Тогда
			Если Найти(СтрокаНомеров, Тек.НомерВнешнегоЗаказа) = 0 Тогда
				Продолжить;
			КонецеСли;	
		КонецеСли;	
		
		ОбработкаПоСтарому = истина;
		Если Гибрид Тогда
			Если Тек.ВидДанных = 1 Тогда
				ОбработкаПоСтарому = истина;
			Иначе
				ОбработкаПоСтарому = Ложь;
			КонецЕсли;
		КонецеСлИ;	
		
		Если ОбработкаПоСтарому Тогда
			Если Тек.НомерВнешнегоЗаказа = "ЗАБОР" Тогда
				Тек.НомерВнешнегоЗаказа = "";
			КонецеСли;	
			
			
			Если Тек.ВидРабот = "ВОЗВРАТ" Тогда
				Тек.СтоимостьГруза = 0;
			КонецеСли;	
			
			Если Не ЗначениеЗаполнено(Тек.ДатаЗабора) Тогда
				Тек.ДатаЗабора = НачалоДня(Тек.ДатаДоставки - 86400);
			КонецеСли;	
			
			Если Тек.СтоимостьГруза = Тек.СтоимостьВозврата И Тек.СтоимостьДоставки = 0 Тогда
				Тек.ВидРабот = "ОТКАЗ";
			КонецЕСли;	
			Если Не ЗначениеЗаполнено(Тек.НомерВнешнегоЗаказа) И Тек.ТипЗаказа = Перечисления.ТипыЗаказов.Забор Тогда
				Тек.ВидРабот = "ЗАБОР";
			ИначеЕсли Не ЗначениеЗаполнено(Тек.НомерВнешнегоЗаказа) И Тек.ТипЗаказа = Перечисления.ТипыЗаказов.Доставка Тогда	
				Тек.ВидРабот = "ДОСТАВКА";
			КонецЕсли;	
			
			Если Тек.ВидРабот = "ОТКАЗ" Тогда
				Тек.ДатаПеречисления = Дата("00010101");
			КонецЕсли;	
			
			
			ЗаполнитьЗначенияСвойств(ОблС.Параметры, Тек);
			ОблС.Параметры.НомерЗаказа = СокрЛП(ОблС.Параметры.НомерЗаказа);
			ОблС.Параметры.НПП = НПП;
			ИтРеал = Тек.СтоимостьГруза - Тек.СтоимостьВозврата;
			СумПол = 0;
			СумГр = 0;
			СумВ = 0;
			ОблС.Параметры.ИтРеал = Тек.СтоимостьГруза - Тек.СтоимостьВозврата;           // - Тек.ПредоплатаПоКредиту
			ОблС.Параметры.НЗ = СокрЛП(Тек.НомерВнешнегоЗаказа);
			КорСум = ЛожЬ;
			СумПол = Тек.СуммаПолученнаяОтПокупателей;
			Если ЗначениеЗаполнено(Тек.СуммаПолученнаяОтПокупателей) И Тек.ВидРабот <> "ОБМЕН" Тогда  //И Тек.ВидРабот <> "ОБМЕН" 
				// Михушкин --->> 
				//ОблС.Параметры.СуммаПолученнаяОтПокупателей = Тек.СтоимостьГруза - Тек.СтоимостьВозврата - Тек.ПредоплатаПоКредиту;
				ОблС.Параметры.СуммаПолученнаяОтПокупателей = Тек.СуммаПолученнаяОтПокупателей;
				// <<--- Михушкин 
				//Тек.СуммаПолученнаяОтПокупателей = Тек.СтоимостьГруза - Тек.СтоимостьВозврата - Тек.ПредоплатаПоКредиту;
				СумПол = Тек.СтоимостьГруза - Тек.СтоимостьВозврата - Тек.ПредоплатаПоКредиту;
				КорСум = Истина;
			КонецеСли;	
			
			
			СумГр = Тек.СтоимостьГруза;
			СумВ = Тек.СтоимостьВозврата;
			
			Най = РезОбмены.Найти(Тек.НомерЗаказа);
			Обмен = Ложь;
			Если Най <> Неопределено Тогда
				ОблС.Параметры.СтоимостьГруза = Най.СуммаТоваров;
				ОблС.Параметры.СтоимостьВозврата = Най.СуммаВозврата;
				Если Тек.ТипОплаты = Справочники.ТипыОплат.Наличные или Тек.ТипОплаты = Справочники.ТипыОплат.ВКредит Тогда
					// Михушкин --->> 
					//ОблС.Параметры.СуммаПолученнаяОтПокупателей = Тек.СтоимостьГруза - Тек.СтоимостьВозврата - Тек.ПредоплатаПоКредиту;
					ОблС.Параметры.СуммаПолученнаяОтПокупателей = Тек.СуммаПолученнаяОтПокупателей;
					// <<--- Михушкин 
					Тек.СуммаПолученнаяОтПокупателей = Най.СуммаТоваров - Най.СуммаВозврата + Тек.Доставка - Тек.ПредоплатаПоКредиту;
					СумПол = Най.СуммаТоваров - Най.СуммаВозврата + Тек.Доставка - Тек.ПредоплатаПоКредиту;
				Иначе
					ОблС.Параметры.СуммаПолученнаяОтПокупателей = 0;
					Тек.СуммаПолученнаяОтПокупателей = 0;
					СумПол = 0;
				КонецеСли;	
				
				ИтРеал = 0;      
				Тек.ВидРабот = "ОБМЕН";
				ОблС.Параметры.ВидРабот = "ОБМЕН";
				ОблС.Параметры.ИтРеал = 0;
				
				СумГр = Най.СуммаТоваров;
				СумВ = Най.СуммаВозврата;
				Обмен = Истина;
			КонецЕсли;	
			
			
			
			
			Если ТолькоИзНакладной003 Тогда
				Если Тек.ВидРабот = "ЗАБОР" Или Не ЗначениеЗаполнено(Тек.НомерВнешнегоЗаказа) Или Тек.НомерВнешнегоЗаказа = "ЗАБОР" Тогда
					
				Иначе	
					Если Рез003.Найти(Тек.НомерЗаказа) = Неопределено Тогда
						Если Тек.ВидРабот = "ДОСТАВКА" Тогда
							Сообщить("-" + Тек.НомерЗаказа);
						КонецеСли;
						Если Тек.ВидРабот = "ОТКАЗ" Тогда
							Продолжить;
						КонецЕсли;	
					КонецеСли;	
				КонецеСли;
			КонецеСли;
			
			
			Если Не Сравнение Тогда
				Если Док <> Неопределено Тогда
					Нов = Док.Заказы.Добавить();
					Нов.Заказ = Тек.Док;
					Нов.СтроковыйПараметр1 = Тек.ВидРабот;
					Нов.ПараметрДаты1 = Тек.ДатаЗабора;
					Нов.ПараметрДаты2 = Тек.ДатаПеречисления;
					
					Нов.НомерСтроки_ = НПП;
					Нов.Сумма1 = СумГр;
					Нов.Сумма2 = СумВ;
					Нов.Сумма3 = ИтРеал;
					Нов.Сумма4 = Тек.АгентскоеВознаграждение;
					Нов.Сумма5 = СумПол;
					Нов.Сумма6 = Тек.СтоимостьДоставки;
					Нов.Период = Тек.ДатаДоставки;
					Нов.НомерЗаказа = СокрЛП(Тек.НомерВнешнегоЗаказа);
					Нов.КорСум = КорСум;
				КонецеСли;
			Иначе
				НайПарт = Док.Заказы.Найти(СокрЛП(Тек.НомерВнешнегоЗаказа));
				Если НайПарт <> Неопределено Тогда
					ОблС.Параметры.СуммаПолученнаяОтПокупателей_ = НайПарт.Сумма5;
				Иначе
					ОблС.Параметры.СуммаПолученнаяОтПокупателей_ = 0;
				КонецеСли;	
			КонецЕСли;
			
			
			Если Не Обмен Тогда
				ИтСтГ = ИтСтГ + Тек.СтоимостьГруза;
				ИтСтВ = ИтСтВ + Тек.СтоимостьВозврата;
				ИтСумР = ИтСумР + Тек.СтоимостьГруза - Тек.СтоимостьВозврата;               // - Тек.ПредоплатаПоКредиту
				ИтСтДос= ИтСтДос + Тек.СтоимостьДоставки;
				Если КорСум Тогда
					
					// Михушкин --->> 
					ИтСумПол = ИтСумПол + Тек.СуммаПолученнаяОтПокупателей;
					//ИтСумПол = ИтСумПол + Тек.СтоимостьГруза - Тек.СтоимостьВозврата - Тек.ПредоплатаПоКредиту;
					// <<--- Михушкин 

					
					//Тек.СуммаПолученнаяОтПокупателей = Тек.СтоимостьГруза - Тек.СтоимостьВозврата;       - Тек.ПредоплатаПоКредиту
				Иначе
					ИтСумПол = ИтСумПол + Тек.СуммаПолученнаяОтПокупателей;
				КонецеСли;	
				ИтАг = ИтАг + Тек.АгентскоеВознаграждение;
			Иначе
				ИтСтГ = ИтСтГ + Най.СуммаТоваров;
				ИтСтВ = ИтСтВ + Най.СуммаВозврата;
				ИтСумР = ИтСумР + Най.СуммаТоваров - Най.СуммаВозврата;          //  - Тек.ПредоплатаПоКредиту
				ИтСтДос= ИтСтДос + Тек.СтоимостьДоставки;
				
				// Михушкин --->> 
				ИтСумПол = ИтСумПол + Тек.СуммаПолученнаяОтПокупателей;
				//ИтСумПол = ИтСумПол + СумПол;
				// <<--- Михушкин
				
				//Тек.СуммаПолученнаяОтПокупателей = СумПол;
				
				ИтАг = ИтАг + Тек.АгентскоеВознаграждение;
			КонецЕСли;
			Таб.Вывести(ОблС);
		Иначе// обработка данных по мнению партнера
			ОблСП.Параметры.НПП = НПП;
			ОблСП.Параметры.ИтРеал = Тек.ИтРеал;
			ОблСП.Параметры.НЗ = СокрЛП(Тек.НомерВнешнегоЗаказа);
			ОблСП.Параметры.СуммаПолученнаяОтПокупателей = Тек.СуммаПолученнаяОтПокупателей;
			ОблСП.Параметры.СтоимостьГруза = Тек.СтоимостьГруза;
			ОблСП.Параметры.СтоимостьВозврата = Тек.СтоимостьВозврата;
			ОблСП.Параметры.ВидРабот = Тек.ВидРабот;
			ОблСП.Параметры.СтоимостьДоставки = Тек.СтоимостьДоставки;
			ОблСП.Параметры.АгентскоеВознаграждение = Тек.АгентскоеВознаграждение;
			ОблСП.Параметры.ДатаЗабора = Тек.ДатаЗабора;
			ОблСП.Параметры.ДатаДоставки = Тек.ДатаДоставки;
			ОблСП.Параметры.ДатаПеречисления = Тек.ДатаПеречисления;
			//Тек.НомерЗаказа = СокрЛП(Тек.НомерЗаказа);
            //Серегин М.В. 26.05.2015 14:10:55 
            ОблСП.Параметры.КомментарийСД  = Тек.КомментарийСД;
            //Серегин М.В. 26.05.2015 14:10:59 
            
			ИтСтГ = ИтСтГ + Тек.СтоимостьГруза;
			ИтСтВ = ИтСтВ + Тек.СтоимостьВозврата;
			ИтСумР = ИтСумР + Тек.СтоимостьГруза - Тек.СтоимостьВозврата;  // - Тек.ПредоплатаПоКредиту
			ИтСтДос= ИтСтДос + Тек.СтоимостьДоставки;
			ИтСумПол = ИтСумПол + Тек.СуммаПолученнаяОтПокупателей;
			ИтАг = ИтАг + Тек.АгентскоеВознаграждение;
			Таб.Вывести(ОблСП);
		КонецеСли;
		
		НПП = НПП + 1;
		
		// проверка с админкой
		Найад = Неопределено;
		НайАд = РезАдминка.Найти(СокрЛП(Тек.НомерЗаказа));
		Если НайАд <> Неопределено Тогда
			Доб = Ложь;
			Если ОблС.Параметры.ИтРеал <> НайАд.ПолнаяСуммаЗаказа Тогда
				ОблЦ = таб.Область("R" + Формат(сч + 2, "ЧГ=") + "C8");
				ОблЦ.ЦветФона = WebЦвета.Орхидея;
				МасСтр.Добавить(Тек);
				Доб = Истина;
			КонецеСли;	
			
			Если ОблС.Параметры.АгентскоеВознаграждение <> Окр(НайАд.КассовоеОбслуживание, 2) Тогда
				ОблЦ = таб.Область("R" + Формат(сч + 2, "ЧГ=") + "C11");
				ОблЦ.ЦветФона = WebЦвета.Орхидея;
				Если Не Доб Тогда
					МасСтр.Добавить(Тек);
					Доб= Истина;
				КонецеСли;	
			КонецеСли;	
			
			Если ОблС.Параметры.СтоимостьДоставки <> НайАд.УслугиСД Тогда
				ОблЦ = таб.Область("R" + Формат(сч + 2, "ЧГ=") + "C9");
				ОблЦ.ЦветФона = WebЦвета.Орхидея;
				Если Не Доб Тогда
					МасСтр.Добавить(Тек);
					Доб= Истина;
				КонецеСли;	
			КонецеСли;	
			
		КонецеСли;	
		
		
		Сч = Сч + 1;
	КонецЦикла;	
	Если Не Сравнение Тогда
	Если Док <> Неопределено Тогда
		Док.Записать(РежимЗаписиДокумента.Запись);
	КонецеСли;	
	КонецеСли;
	
	ОблП = мак.ПолучитьОбласть("Подвал1");
	
	ОблП.Параметры.ИтСтГ = ИтСтГ;
	ОблП.Параметры.ИтСтВ = ИтСтВ;
	ОблП.Параметры.ИтСумР = ИтСумР;
	ОблП.Параметры.ИтСтДос = ИтСтДос;
	ОблП.Параметры.ИтСумПол = ИтСумПол;
	ОблП.Параметры.ИтАг = ИтАг;
	
	ОблП.Параметры.ИтСтГНДС = Окр(ИтСтГ - ИтСтГ/1.18, 2);
	ОблП.Параметры.ИтСтВНДС = Окр(ИтСтВ - ИтСтВ/1.18, 2);
	ОблП.Параметры.ИтСумРНДС = Окр(ИтСумР - ИтСумР/1.18, 2);
	//ОблП.Параметры.ИтСтДосНДС = Окр(ИтСтДос - ИтСтДос/1.18, 2);
	//ОблП.Параметры.ИтСумПолНДС = Окр(ИтСумПол - ИтСумПол/1.18, 2);
	//ОблП.Параметры.ИтАгНДС = Окр(ИтАг - ИтАг/1.18, 2);
	Таб.Вывести(ОблП);
	Если флПоказыватьОшибки И МасСтр.Количество() <> 0 Тогда
		Если флПоказыватьОшибки Тогда
			Таб.Вывести(ОблШ);
		КонецеСли;
		Сч = Сч + 5;
		ОблС = Мак.ПолучитьОбласть("Строка");
		
		Для Каждого Тек Из МасСтр Цикл
			ЗаполнитьЗначенияСвойств(ОблС.Параметры, Тек);
			ОблС.Параметры.ИтРеал = Тек.СтоимостьГруза - Тек.СтоимостьВозврата;     // - Тек.ПредоплатаПоКредиту
			ОблС.Параметры.НЗ = СокрЛП(Тек.НомерВнешнегоЗаказа);
			ОблС.параметры.НПП = 0;
			Если флПоказыватьОшибки Тогда
				Таб.Вывести(ОблС);
			КонецеСли;	
			Найад = Неопределено;
			НайАд = РезАдминка.Найти(СокрЛП(Тек.НомерЗаказа));
			Если НайАд <> Неопределено Тогда
				Если ОблС.Параметры.ИтРеал <> НайАд.ПолнаяСуммаЗаказа Тогда
					ОблЦ = таб.Область("R" + Формат(сч, "ЧГ=") + "C8");
					ОблЦ.ЦветФона = WebЦвета.Орхидея;
				КонецеСли;	
				
				Если ОблС.Параметры.АгентскоеВознаграждение <> Окр(НайАд.КассовоеОбслуживание, 2) Тогда
					ОблЦ = таб.Область("R" + Формат(сч, "ЧГ=") + "C11");
					ОблЦ.ЦветФона = WebЦвета.Орхидея;
				КонецеСли;	
				
				Если ОблС.Параметры.СтоимостьДоставки <> НайАд.УслугиСД Тогда
					ОблЦ = таб.Область("R" + Формат(сч, "ЧГ=") + "C9");
					ОблЦ.ЦветФона = WebЦвета.Орхидея;
				КонецеСли;	
				Сч = Сч + 1;
			КонецеСли;
			
		КонецЦикла;	
	КонецЕсли;
	
	Если СИтогамиПоДням Тогда
		Таб.Вывести(ОблШ);
		Рез.Свернуть("ДатаДоставки", "СтоимостьГруза, СтоимостьВозврата, АгентскоеВознаграждение, СуммаПолученнаяОтПокупателей, СтоимостьДоставки");
		Для Каждого Тек Из Рез Цикл
			ОблС = Мак.ПолучитьОбласть("Строка");
			ЗаполнитьЗначенияСвойств(ОблС.Параметры, Тек);
			ОблС.Параметры.ИтРеал = Тек.СтоимостьГруза - Тек.СтоимостьВозврата;     // - Тек.ПредоплатаПоКредиту
			ОблС.параметры.НПП = 0;
			Таб.Вывести(ОблС);			
		КонецЦикла;	
	КонецеСли;	
	
	Таб.ИмяПараметровПечати = "Приложение_4_ММ";
	
	
	Возврат Таб;
	
	
	
КонецФункции
